Documents/А_ОтражениеЗарплатыВУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>А_ОтражениеЗарплатыВУчете</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОбмена30</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗарплатаОтраженаВБухучете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОценочныеОбязательства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтражениеВУчете</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговоеНазначениеДоходовИЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговоеНазначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеОтражатьВБУ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/А_ОтражениеЗарплатыВУчете/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль формы документа А_ОтражениеЗарплатыВУчете
// Обработка субконто в табличной части ОтражениеВУчете

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Инициализация заголовков субконто для первой строки, если она есть
	Если Объект.ОтражениеВУчете.Количество() > 0 Тогда
		ИдСтроки = Объект.ОтражениеВУчете[0].ПолучитьИдентификатор();
		Элементы.ОтражениеВУчете.ТекущаяСтрока = ИдСтроки;
		УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.ОтражениеВУчете[0].СчетДт, "Дт");
		УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.ОтражениеВУчете[0].СчетКт, "Кт");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// Обработчик перед записью
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Обработчик при чтении на сервере
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// Обработчик после записи
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Обработчик после записи на сервере
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	// Обработчик изменения даты
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	// Обработчик изменения организации
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	// Обработчик изменения периода регистрации
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	// Обработчик автоподбора периода
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	// Обработчик регулирования периода
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	// Обработчик окончания ввода текста периода
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаОтраженаВБухучетеПриИзменении(Элемент)
	// Обработчик изменения флага отражения
КонецПроцедуры

&НаКлиенте
Процедура ФорматОбмена30ПриИзменении(Элемент)
	// Обработчик изменения формата обмена
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	// Обработчик изменения вида документа
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтражениеВУчете

// Обработчик перед началом изменения строки таблицы
//
&НаКлиенте
Процедура ОтражениеВУчетеПередНачаломИзменения(Элемент, Отказ)

	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Элемент.ТекущиеДанные.СчетДт, "Дт");
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Элемент.ТекущиеДанные.СчетКт, "Кт");

КонецПроцедуры

// Обработчик при начале редактирования строки
//
&НаКлиенте
Процедура ОтражениеВУчетеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда
		УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Элемент.ТекущиеДанные.СчетДт, "Дт");
		УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Элемент.ТекущиеДанные.СчетКт, "Кт");
	КонецЕсли;

КонецПроцедуры

// Обработчик при изменении данных в таблице
//
&НаКлиенте
Процедура ОтражениеВУчетеПриИзменении(Элемент)

	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Элемент.ТекущиеДанные.СчетДт, "Дт");
		УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Элемент.ТекущиеДанные.СчетКт, "Кт");
	КонецЕсли;

КонецПроцедуры

// Обработчик изменения счета дебета
//
&НаКлиенте
Процедура ОтражениеВУчетеСчетДтПриИзменении(Элемент)

	ОбработатьИзменениеСчета("Дт");

КонецПроцедуры

// Обработчик изменения счета кредита
//
&НаКлиенте
Процедура ОтражениеВУчетеСчетКтПриИзменении(Элемент)

	ОбработатьИзменениеСчета("Кт");

КонецПроцедуры

// Обработчик изменения субконто дебета
//
&НаКлиенте
Процедура ОтражениеВУчетеСубконтоДтПриИзменении(Элемент)

	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "Дт");

КонецПроцедуры

// Обработчик изменения субконто кредита
//
&НаКлиенте
Процедура ОтражениеВУчетеСубконтоКтПриИзменении(Элемент)

	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "Кт");

КонецПроцедуры

// Обработчик начала выбора субконто дебета
//
&НаКлиенте
Процедура ОтражениеВУчетеСубконтоДтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СписокПараметров = ПолучитьСписокПараметров(ЭтаФорма, Элементы.ОтражениеВУчете.ТекущиеДанные, "СубконтоДт%Индекс%", "СчетДт");
	ОбщегоНазначенияБПКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, СписокПараметров);

КонецПроцедуры

// Обработчик начала выбора субконто кредита
//
&НаКлиенте
Процедура ОтражениеВУчетеСубконтоКтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СписокПараметров = ПолучитьСписокПараметров(ЭтаФорма, Элементы.ОтражениеВУчете.ТекущиеДанные, "СубконтоКт%Индекс%", "СчетКт");
	ОбщегоНазначенияБПКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, СписокПараметров);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Изменяет параметры выбора полей субконто
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа
//  ДтКт  - Строка - "Дт" или "Кт"
//
&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПараметрыВыбораПолейСубконто(Форма, ДтКт)

	ИдСтроки = Форма.Элементы.ОтражениеВУчете.ТекущаяСтрока;
	Если ИдСтроки <> Неопределено Тогда
		СтрокаТаблицы = Форма.Объект.ОтражениеВУчете.НайтиПоИдентификатору(ИдСтроки);
		ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаТаблицы, "Субконто" + ДтКт + "%Индекс%", "Счет" + ДтКт);
		НастройкаСчетовУчетаКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(
			Форма, СтрокаТаблицы, "Субконто" + ДтКт + "%Индекс%", "ОтражениеВУчетеСубконто" + ДтКт + "%Индекс%", ПараметрыДокумента);
	КонецЕсли;

КонецПроцедуры

// Устанавливает заголовки и доступность субконто в зависимости от выбранного счета
//
// Параметры:
//  Форма    - ФормаКлиентскогоПриложения - форма документа
//  Счет     - ПланСчетовСсылка.Хозрасчетный - выбранный счет
//  ДтКт     - Строка - "Дт" или "Кт"
//
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконто(Форма, Счет, ДтКт)

	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
		"ОтражениеВУчетеСубконто" + ДтКт + "1",
		"ОтражениеВУчетеСубконто" + ДтКт + "2",
		"ОтражениеВУчетеСубконто" + ДтКт + "3");

	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Счет, Форма, ПоляФормы, Неопределено, Истина);

КонецПроцедуры

// Обрабатывает изменение счета (дебет или кредит)
//
// Параметры:
//  ДтКт - Строка - "Дт" или "Кт"
//
&НаКлиенте
Процедура ОбработатьИзменениеСчета(ДтКт)

	ТекущиеДанные = Элементы.ОтражениеВУчете.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Настройка полей формы для отображения субконто
	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3");
	ПоляФормы.Субконто1 = "ОтражениеВУчетеСубконто" + ДтКт + "1";
	ПоляФормы.Субконто2 = "ОтражениеВУчетеСубконто" + ДтКт + "2";
	ПоляФормы.Субконто3 = "ОтражениеВУчетеСубконто" + ДтКт + "3";
	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(ТекущиеДанные["Счет" + ДтКт], ЭтаФорма, ПоляФормы, Неопределено, Истина);

	// Настройка полей объекта для очистки/приведения значений субконто
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3, Организация");
	ПоляОбъекта.Субконто1   = "Субконто" + ДтКт + "1";
	ПоляОбъекта.Субконто2   = "Субконто" + ДтКт + "2";
	ПоляОбъекта.Субконто3   = "Субконто" + ДтКт + "3";
	ПоляОбъекта.Организация = Объект.Организация;
	БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(ТекущиеДанные["Счет" + ДтКт], ТекущиеДанные, ПоляОбъекта, Истина);

	// Изменить параметры выбора для связанных субконто
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, ДтКт);

КонецПроцедуры

// Формирует список параметров для выбора субконто
//
// Параметры:
//  Форма                - ФормаКлиентскогоПриложения - форма документа
//  СтрокаТаблицы        - ДанныеФормыЭлементКоллекции - текущая строка таблицы
//  ШаблонИмяПоляОбъекта - Строка - шаблон имени поля объекта
//  ИмяПоляСчетУчета     - Строка - имя поля счета учета
//
// Возвращаемое значение:
//  Структура - список параметров для выбора
//
&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокПараметров(Форма, СтрокаТаблицы, ШаблонИмяПоляОбъекта, ИмяПоляСчетУчета)

	Возврат НастройкаСчетовУчетаКлиентСервер.ПараметрыВыбораСубконто(
		Форма.Объект.Организация,
		СтрокаТаблицы,
		ШаблонИмяПоляОбъекта,
		ИмяПоляСчетУчета);

КонецФункции

#КонецОбласти
